#include "Map.h"

Map::Map()
{
	map =
	{
		{1, 1, 1, 1, 1, 1, 1, 1, 1, 1},
		{1, 0, 0, 0, 0, 0, 0, 0, 0, 1},
		{1, 0, 0, 0, 0, 0, 0, 0, 0, 1},
		{1, 0, 0, 0, 0, 0, 0, 0, 0, 1},
		{1, 0, 0, 0, 0, 0, 0, 0, 0, 1},
		{1, 0, 0, 0, 0, 0, 0, 0, 0, 1},
		{1, 0, 0, 0, 0, 0, 0, 0, 0, 1},
		{1, 0, 0, 0, 0, 0, 0, 0, 0, 1},
		{1, 0, 0, 0, 0, 0, 0, 0, 0, 1},
		{1, 1, 1, 1, 1, 1, 1, 1, 1, 1}
	};

}

vector<vector<int>> Map::getMap()
{
	return map;
}

void Map::setMap(int X, int Y, int status)
{
	if (status == 0) // 지우는 거
	{
		map[Y][X] = 0;
	}
	else if (status == 1) // 플레이어 그리는 거
	{
		map[Y][X] = 2;
	}
	//else if (status == 2) // 몬스터 그리는 거
	//{
	//	map[Y][X] = 3;
	//}
}
